day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/cyl_ste_uns/constant/transportProperties_RE200
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;	//RE 200
//nu              nu [ 0 2 -1 0 0 0 0 ] 0.1;	//RE 20

// ************************************************************************* //
