day4/9_Crash_introduction_to_the_FVM/fvm_numerical_playground/cyl_ste_uns/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (1 0 0)
);

regions
(
    boxToCell
    {
        box (0 -100 -100) (100 100 100);
        fieldValues
        (
            volVectorFieldValue U (0.98480 0.17364 0)
        );
    }
);

// ************************************************************************* //
